# Цель задания
# Научится работать с функциями, параметрами функций и вещественными числами.

#Что нужно сделать:
#Зайдите в файлы с заданиями и выполните так чтобы вывод соотвествовал условиям.

# Расскоментируйте нужные строки, чтобы запустить задания. 
# Удалите знак # для запуска, чтобы строка была без комметариев
# Пример: import task_01 


#import task_01
#import task_02
#import task_03
#import task_04
#import task_05
#import task_06
#import task_07
#import task_08
#import task_09
import task_10