
print('Задача 2. Функция максимума')

# Юра пишет различные полезные функции для Питона,
# чтобы остальным программистам стало проще работать.

# Он захотел написать функцию,
# которая будет находить максимум из перечисленных чисел.
# Функция для нахождения максимума из двух чисел у него уже есть.

# Юра задумался: может быть, её можно как-то использовать
# для нахождения максимума уже от трёх чисел?


# Напишите программу,
# которая находит максимум из трёх чисел.
# Для этого используйте только функцию нахождения максимума из двух чисел.


def maximum(number_one,number_two):
    number_one = ((number_one + number_two) + abs(number_one - number_two)) / 2
    return number_one
number_one = int(input('Введите первое число: '))
number_two = int(input('Введите второе число: '))
number_one = maximum(number_one,number_two)
number_two = int(input('Введите третье число: '))
number_one = maximum(number_one,number_two)
print('Максимальное из введённых чисел:',int(number_one))